#include <iostream>

using namespace std;

bool plus3(int* a)//, int i)//a[i]: empty -> X -> 0 -> empty -> ... 
{
	int i = 8;
	while (i >= 0)
	{
		if (a[i] == 2)
		{
			if (i == 0)
				return 1;//последнее поле, т.е. 222222222
			a[i] = 0;
			--i;
		}
		else
		{
			a[i]++;
			return 0;
		}
	}
}


int main()
{
	int pole[9];//0 1 2    Значения: 0 - пусто  По факту это 9-значное число в троичной истеме исчисления
				//3 4 5				 1 - крест
				//6 7 8				 2 - нолик
	for (int i = 0; i < 9; ++i)
		pole[i] = 0;//Пустое поле
	int number = 0;//Это число, чтобы видет, сколько еще осталось. Всего 3^9 = 19683
	int sum = 0;
	bool end = 0;
	while (!end)
	{
		//Проверка на реальность
		int Xnum = 0;
		int Onum = 0;
		for(int i = 0; i < 9; ++i)
		{
			if (pole[i] == 1)
				Xnum++;
			if (pole[i] == 2)
				Onum++;
		}
		if (Xnum - Onum == 0)//Проверка на количество, последний ход - ход О, нужно проверить, есть ли 3 X в ряд, если есть, то этот пример нереален.
		{
			//Всего 8 рядов из 3-х Х может быть
			if (!((pole[0] == 1 && pole[4] == 1 && pole[8] == 1) || (pole[2] == 1 && pole[4] == 1 && pole[6] == 1) || // диагонали
				(pole[0] == 1 && pole[1] == 1 && pole[2] == 1) || (pole[3] == 1 && pole[4] == 1 && pole[5] == 1) || (pole[6] == 1 && pole[7] == 1 && pole[8] == 1) ||//горизонтали
				(pole[0] == 1 && pole[3] == 1 && pole[6] == 1) || (pole[1] == 1 && pole[4] == 1 && pole[7] == 1) || (pole[2] == 1 && pole[5] == 1 && pole[8] == 1)))//вертикали
				++sum;
		}
		if (Xnum - Onum == 1)//Проверка на количество, последний ход - ход X, нужно проверить, есть ли 3 О в ряд, если есть, то этот пример нереален.
		{
			//Всего 8 рядов из 3-х О может быть
			if (!((pole[0] == 2 && pole[4] == 2 && pole[8] == 2) || (pole[2] == 2 && pole[4] == 2 && pole[6] == 2) || // диагонали
				(pole[0] == 2 && pole[1] == 2 && pole[2] == 2) || (pole[3] == 2 && pole[4] == 2 && pole[5] == 2) || (pole[6] == 2 && pole[7] == 2 && pole[8] == 2) ||//горизонтали
				(pole[0] == 2 && pole[3] == 2 && pole[6] == 2) || (pole[1] == 2 && pole[4] == 2 && pole[7] == 2) || (pole[2] == 2 && pole[5] == 2 && pole[8] == 2)))//вертикали
				++sum;
		}
		//Моделирование следующего поля:
		end = plus3(pole);
		number++;
		cout << number << " / 19683\n";
	}
	cout << "\nTOTAL: " << sum;
	return 0;
}

